/*----------------------------------------------*/
/*ファイル名：ｃ02-1.c				*/
/*作　成　日：2014/04/25			*/
/*作　成　者：0Ｇ03004　井上 駿			*/
/*----------------------------------------------*/
/*ヘッダファイル--------------------------------*/
#include<stdio.h>

/*プロトタイプ宣言------------------------------*/
void Put_Square(int length);

/*----------------------------------------------*/
/*関数名:main					*/
/*戻り値:正常終了：０				*/
/*引　数:なし					*/
/*----------------------------------------------*/
int main(void)
{
	int length;

	printf("正方形を出力します。\n");

	printf("辺の長さを入力;");
	scanf("%d", &length);

	Put_Square(length);

	return 0;
}

/*----------------------------------------------*/
/*関数名:Put_Square				*/
/*機　能;正方形を出力する			*/
/*戻り値:なし					*/
/*引　数:・int length:辺の長さ			*/
/*----------------------------------------------*/
void Put_Square(int length)
{
	int i, j;

	for ( i = 0 ; i < length ; i++) {
		for (j = 0 ; j< length ; j++ ) {
			printf("■");
		}
		printf("\n");
	}
}