/*------------------------------------------------------*/
/*ファイル名：ｃ06-3.c					*/
/*作　成　日：2014/05/23				*/
/*作　成　者：0Ｇ03004　井上 駿				*/
/*------------------------------------------------------*/
/*ヘッダファイル----------------------------------------*/
#include<stdio.h>

/*プロトタイプ宣言--------------------------------------*/
double Get_Sankaku(int teihen, int takasa);

/*エントリポイント Get_Sankaku関数の動作チェック--------*/

/*------------------------------------------------------*/
/*関数名:main						*/
/*戻り値:正常終了：０					*/
/*引　数:なし						*/
/*------------------------------------------------------*/
int main(void)
{

	int teihen, takasa;
	double menseki;


	printf("三角形の面積を求めます。\n");

	printf("底辺を入力:");
	scanf("%d", &teihen);
	printf("高さを入力:");
	scanf("%d", &takasa);
	
	menseki = Get_Sankaku(teihen, takasa);
	printf("三角形の面積は「%.2f」です、\n" , menseki);

	return 0;
}

/*------------------------------------------------------*/
/*関数名:Get_Sankaku					*/
/*機能:  三角形の面積を求める				*/
/*戻り値:三角形の面積(double型）			*/
/*引　数:・int teihen: 底辺				*/
/*       ・int takasa: 高さ				*/
/*------------------------------------------------------*/
double Get_Sankaku(int teihen, int takasa)
{
	double menseki;

	menseki = (double)teihen * takasa / 2;

	return menseki;
}