/*----------------------------------------------*/
/*ファイル名：ｃ06-1.c				*/
/*作　成　日：2014/05/15			*/
/*作　成　者：0Ｇ03004　井上 駿			*/
/*----------------------------------------------*/
/*ヘッダファイル--------------------------------*/
#include<stdio.h>

/*----------------------------------------------*/
/*関数名:main					*/
/*戻り値:正常終了：０				*/
/*引　数:なし					*/
/*----------------------------------------------*/
int main(void)
{

	int a1 = 10, a2 = 5;
	int b1 = 25, b2 = 7;
	int c1 = 150, c2 = 50;


	printf("%d + %d = %d\n", a1, a2, a1 + a2);
	printf("%d - %d = %d\n", a1, a2, a1 - a2);
	printf("%d * %d = %d\n", a1, a2, a1 * a2);
	printf("%d / %d = %d\n", a1, a2, a1 / a2);
	printf("%d %% %d = %d\n", a1, a2, a1 % a2);

	printf("%d + %d = %d\n", b1, b2, b1 + b2);
	printf("%d - %d = %d\n", b1, b2, b1 - b2);
	printf("%d * %d = %d\n", b1, b2, b1 * b2);
	printf("%d / %d = %d\n", b1, b2, b1 / b2);
	printf("%d %% %d = %d\n", b1, b2, b1 % b2);

	printf("%d + %d = %d\n", c1, c2, c1 + c2);
	printf("%d - %d = %d\n", c1, c2, c1 - c2);
	printf("%d * %d = %d\n", c1, c2, c1 * c2);
	printf("%d / %d = %d\n", c1, c2, c1 / c2);
	printf("%d %% %d = %d\n", c1, c2, c1 % c2);

	return 0;
}