/*----------------------------------------------*/
/*ファイル名：ｃ06-2.c				*/
/*作　成　日：2014/05/15			*/
/*作　成　者：0Ｇ03004　井上 駿			*/
/*----------------------------------------------*/
/*ヘッダファイル--------------------------------*/
#include<stdio.h>

/*プロトタイプ宣言------------------------------*/
void Put_Keisan(int x, int y);
/*----------------------------------------------*/
/*関数名:main					*/
/*戻り値:正常終了：０				*/
/*引　数:なし					*/
/*----------------------------------------------*/
int main(void)
{
	int a1 = 10, a2 = 5;
	int b1 = 10, b2 = 7;
	int c1 = 150, c2 = 50;


	Put_Keisan(a1,a2);
	Put_Keisan(b1,b2);
	Put_Keisan(c1,c2);

	return 0;
}

void Put_Keisan(int x, int y)
{
	printf("%d + %d = %d\n" , x, y, x + y);
	printf("%d - %d = %d\n" , x, y, x - y);
	printf("%d * %d = %d\n" , x, y, x * y);
	printf("%d / %d = %d\n" , x, y, x / y);
	printf("%d %% %d = %d\n" , x, y, x % y);
}