/*----------------------------------------------*/
/*ファイル名：ｃ07-2.c				*/
/*作　成　日：2014/05/29			*/
/*作　成　者：0Ｇ03004　井上 駿			*/
/*----------------------------------------------*/
/*ヘッダファイル--------------------------------*/
#include<stdio.h>

/*----------------------------------------------*/
/*関数名:main					*/
/*戻り値:正常終了：０				*/
/*引　数:なし					*/
/*----------------------------------------------*/
int main(void)
{
	char	cd;	//文字型	char
	int	id;	//整数型	int
	float	fd;	//実数型	float
	double	dd;	//倍精度実数型	double
	char	str[80];//文字型	char型1次元配列


	//入力処理
	printf("文字入力　：");	scanf("%c",&cd);	//文字入力	%c
	printf("整数入力　：");	scanf("%d",&id);	//int型に入力	%d
	printf("実数入力　：");	scanf("%f",&fd);	//float型に入力	%f
	printf("実数入力　：");	scanf("%lf",&dd);	//double型に入力%lf
	printf("文字列入力：");	scanf("%s",str);	//文字列入力	%s

	//出力処理
	printf("文字出力　：%c\n",cd);			//文字出力	%c
	printf("整数出力　：%d\n",id);			//int型に出力	%d
	printf("実数出力　：%f\n",fd);			//float型に出力	%f
	printf("実数出力　：%f\n",dd);			//double型に出力%lf
	printf("文字列出力：%s\n",str);			//文字列出力	%s

	return 0;
}