/*----------------------------------------------*/
/*ファイル名：ｃ02-1.c				*/
/*作　成　日：2014/04/25			*/
/*作　成　者：0Ｇ03004　井上 駿			*/
/*----------------------------------------------*/
/*ヘッダファイル--------------------------------*/
#include<stdio.h>

/*----------------------------------------------*/
/*関数名:main					*/
/*戻り値:正常終了：０				*/
/*引　数:なし					*/
/*----------------------------------------------*/
int main(void)
{

	int data; //変数の宣言


	//データの入力 (10進数)
	printf("10進数でデータを入力:");
	scanf("%d",&data);

	//様々な進数で出力
	printf("8進数:%o\n", data);		//8進数  :%o
	printf("10進数:%d\n", data);		//10進数 :%d
	printf("16進数（小文字）: %x\n", data);	//16進数（小文字 ：%x
	printf("16進数（大文字）: %X\n", data);	//16進数 (大文字) :%X

	return 0;
}