/*----------------------------------------------*/
/*ファイル名：ｃ08-2.c				*/
/*作　成　日：2014/06/12			*/
/*作　成　者：0Ｇ03004　井上 駿			*/
/*----------------------------------------------*/
/*ヘッダファイル--------------------------------*/
#include<stdio.h>

/*プロトタイプ宣言------------------------------*/
#define SHOUHIZEI 1.08 /*記号定数*/

/*----------------------------------------------*/
/*関数名:main					*/
/*戻り値:正常終了：０				*/
/*引　数:なし					*/
/*----------------------------------------------*/
int main(void)
{
	
	int okane;

	printf("金額を入力してください：");
	scanf("%d", &okane);

	printf("消費税を含めると%5.0f円です\n", okane * SHOUHIZEI);

	return 0;
}