/*----------------------------------------------*/
/*ファイル名：ｃ11-4.c				*/
/*作　成　日：2014/06/13			*/
/*作　成　者：0Ｇ03004　井上 駿			*/
/*----------------------------------------------*/
/*ヘッダファイル--------------------------------*/
#include<stdio.h>

/*----------------------------------------------*/
/*関数名:main					*/
/*戻り値:正常終了：０				*/
/*引　数:なし					*/
/*----------------------------------------------*/
int main(void)
{
	int tuki;

	printf("月を入力[1～12] : ");
	scanf("%d", &tuki);

	switch ( tuki ) {
		case  3:
		case  4:
		case  5:	
			printf("季節は「春」です\n");
			break;
		case  6:
		case  7:
		case  8:
			printf("季節は「夏」です\n");
			break;
		case  9:
		case 10:
		case 11:	
			printf("季節は「秋」です\n");
			break;
		case 12:
		case  1:
		case  2:	
			printf("季節は「冬」です\n");
			break;
		default:
			printf("入力エラー\n");
	}

	return 0;
}