/*----------------------------------------------*/
/*ファイル名：ｃ11-1.c				*/
/*作　成　日：2014/06/13			*/
/*作　成　者：0Ｇ03004　井上 駿			*/
/*----------------------------------------------*/
/*ヘッダファイル--------------------------------*/
#include<stdio.h>

/*----------------------------------------------*/
/*関数名:main					*/
/*戻り値:正常終了：０				*/
/*引　数:なし					*/
/*----------------------------------------------*/
int main(void)
{
	int ten;

	printf("点数を入力[0～100]：");
	scanf("%d", &ten);

	if ( 0 <= ten && ten <= 100 )
		printf("入力された点数は「%d」です\n", ten);
	else
		printf("入力エラー：範囲外のデータが入力されました\n");

	return 0;
}