/*----------------------------------------------*/
/*ファイル名：ｃ13-2.c				*/
/*作　成　日：2014/06/24			*/
/*作　成　者：0Ｇ03004　井上 駿			*/
/*----------------------------------------------*/
/*ヘッダファイル--------------------------------*/
#include<stdio.h>

/*----------------------------------------------*/
/*関数名:main					*/
/*戻り値:正常終了：０				*/
/*引　数:なし					*/
/*----------------------------------------------*/
int main(void)
{
	long d[5];
	int a,b;


	a = sizeof(long);
	printf("long型のサイズは「%dバイト」です\n",a);

	b = sizeof d;
	printf("配列ｄのサイズは「%dバイト」です\n", b);

	return 0;
}