/*----------------------------------------------*/
/*ファイル名：ｃ13-1.c				*/
/*作　成　日：2014/06/24			*/
/*作　成　者：0Ｇ03004　井上 駿			*/
/*----------------------------------------------*/
/*ヘッダファイル--------------------------------*/
#include<stdio.h>

/*プロトタイプ宣言------------------------------*/
#define SIZE 3 /*配列のサイズ */
/*----------------------------------------------*/
/*関数名:main					*/
/*戻り値:正常終了：０				*/
/*引　数:なし					*/
/*----------------------------------------------*/
int main(void)
{

	int data[SIZE], i, sum;


	printf("配列にデータを入力\n");
	for (i=0; i<SIZE ; i++) {
		printf("data[%d]=", i);
		scanf("%d", &data[i]);
	}

	printf("\n配列の合計を求める\n");
	for (i=0, sum=0; i<SIZE; i++) {
		sum+=data[i];
		printf("data[%d]=%2d sum=%3d\n", i, data[i], sum);
	}

	return 0;
}