/*----------------------------------------------*/
/*ファイル名：ｃ15-1.c				*/
/*作　成　日：2014/07/01			*/
/*作　成　者：0Ｇ03004　井上 駿			*/
/*----------------------------------------------*/
/*ヘッダファイル--------------------------------*/
#include<stdio.h>
#include <ctype.h>

/*----------------------------------------------*/
/*関数名:main					*/
/*戻り値:正常終了：０				*/
/*引　数:なし					*/
/*----------------------------------------------*/
int main(void)
{

	char str[81], org[81];
	int i, cnt;


	printf("半角文字列を入力：");
	scanf("%s", str);

		
	/*空文による文字列のコピー*/
	for (i = 0 ; org[i] = str[i] ; i++ );

	cnt = 0;
	i = 0;
	while ( str[i] != '\0' ) {
		if ( islower(str[i]) ) {
			cnt++;
			str[i] = toupper(str[i]);
		}
		i++;
	}

	printf("変換前の文字列「%s」\n", org);
	printf("変換後の文字列「%s」\n", str);
	printf("変換した文字数「%d」\n", cnt);

	return 0;
}