/*----------------------------------------------*/
/*ファイル名：ｃkadai04.c				*/
/*作　成　日：2014/05/15			*/
/*作　成　者：0Ｇ03004　井上 駿			*/
/*----------------------------------------------*/
/*ヘッダファイル--------------------------------*/
#include<stdio.h>

/*----------------------------------------------*/
/*関数名:main					*/
/*戻り値:正常終了：０				*/
/*引　数:なし					*/
/*----------------------------------------------*/
int main(void)
{
	int x, y;

	printf("x=");		/* xの入力をうながす */
	scanf("%d" , &x);	/* xの入力 */

	printf("y=");		/* yの入力をうながす */
	scanf("%d" , &y);	/* yの入力 */	

	printf("x+y=%d\n" , x+y);
	printf("x-y=%d\n" , x-y);
	printf("x*y=%d\n" , x*y);
	printf("x/y=%d\n" , x/y);
	printf("x%%y=%d\n" , x%y);

	return 0;
}