/*----------------------------------------------*/
/*ファイル名：ｃkadai34.c			*/
/*作　成　日：2014/07/01			*/
/*作　成　者：0Ｇ03004　井上 駿			*/
/*----------------------------------------------*/
/*ヘッダファイル--------------------------------*/
#include<stdio.h>
#include <ctype.h>

/*----------------------------------------------*/
/*関数名:main					*/
/*戻り値:正常終了：０				*/
/*引　数:なし					*/
/*----------------------------------------------*/
int main(void)
{

	char str[80], org[80];
	int i, cnt1, cnt2;


	printf("半角文字列を入力：");

	for ( i = 0 ; org[i] = str [i] ; i++ );

	cnt1 = 0;
	cnt2 = 0;
	i = 0;
	while (str[i] !='\0' ) {
		if ( islower(str[i]) ) {
			cnt++;
			str[i] = toupper(str[i]);
		}
		i++;
	}

	printf("英大文字「%d」\n", 