/*----------------------------------------------*/
/*ファイル名：ｃkadai17.c			*/
/*作　成　日：2014/06/13			*/
/*作　成　者：0Ｇ03004　井上 駿			*/
/*----------------------------------------------*/
/*ヘッダファイル--------------------------------*/
#include<stdio.h>

/*----------------------------------------------*/
/*関数名:main					*/
/*戻り値:正常終了：０				*/
/*引　数:なし					*/
/*----------------------------------------------*/
int main(void)
{
	int a;

	printf("整数値を入力してください：");
	scanf("%d", &a);

	switch (a)	{
		case 0:
			printf("「零です」\n");
			break;
		case 1:
			printf("「壱です」\n");
			break;
		case 2:
			printf("「弐です」\n");
			break;
		default:
			printf("「零でも壱でも弐でもありません」");
			}
	return 0;
}