/*----------------------------------------------*/
/*ファイル名：ｃkadai14.c			*/
/*作　成　日：2014/06/13			*/
/*作　成　者：0Ｇ03004　井上 駿			*/
/*----------------------------------------------*/
/*ヘッダファイル--------------------------------*/
#include<stdio.h>

/*----------------------------------------------*/
/*関数名:main					*/
/*戻り値:正常終了：０				*/
/*引　数:なし					*/
/*----------------------------------------------*/
int main(void)
{
	int x, y;

	printf("x=");
	scanf("%d", &x);

	printf("y=");
	scanf("%d", &y);

	if(x==y)
		printf("xとyは等しいです\n");
	else if(x>y)
		printf("xの方が大きいです\n");
	else if(x<y)
		printf("yの方が大きいです\n");
	return 0;
}